<template>
  <div>
    <div class="container">
      <div class="row" style="margin-top:2em;margin-bottom:2em;">
        <div class="col-md-3">
          <el-aside width="100%" style="background-color: white">
            <el-menu :default-openeds="['1','2','3']" default-active="1-1">
              <el-submenu index="1">
                <template slot="title" @click="choose(1,'1')"  >欢迎</template>
            
                <el-menu-item-group>
                  <el-menu-item index="1-1" @click="choose(1,'div1-1')" >酷代简介</el-menu-item>
                  <el-menu-item index="1-2" @click="choose(1,'div1-2')">使命与愿景</el-menu-item>
                  <el-menu-item index="1-3" @click="choose(1,'div1-3')">联系方式</el-menu-item>
                </el-menu-item-group>
              </el-submenu>

              <el-submenu index="2">
                <template slot="title" @click="choose(2,'2')">常见问题</template>
                <el-menu-item-group>
                  <el-menu-item index="2-1" @click="choose(2,'div2-1')">接单人员</el-menu-item>
                  <el-menu-item index="2-2" @click="choose(2,'div2-2')">企业方</el-menu-item>
                </el-menu-item-group>
              </el-submenu>

              <el-submenu index="3">
                <template slot="title" @click="choose(3,'3')">开发者签约</template>
                <el-menu-item-group>
                  <el-menu-item index="3-1" @click="choose(3,'div3-1')">如何签约</el-menu-item>
                  <el-menu-item index="3-2" @click="choose(3,'div3-2')">签约规则</el-menu-item>
                  <el-menu-item index="3-3" @click="choose(3,'div3-3')">签约失败说明</el-menu-item>
                  <el-menu-item index="3-4" @click="choose(3,'div3-4')">取消签约</el-menu-item>
                </el-menu-item-group>
              </el-submenu>
            </el-menu>
          </el-aside>
        </div>
        <div class="col-md-9" style="margin-bottom:2em;">
          <el-card shadow="never">
              <!-- 欢迎 -->
            <template v-if="active == 1">
                <div id="div1-1">
                    <h2>酷代简介</h2>
                    <hr>
                    <p>
                        CoolDai可以帮助企业在线雇用专业人才，并最终顺利完成项目工作。
                        与此同时，CoolDai也为个人和团队及外包公司提供了一个没有时间地点限制的找项目平台。
                        网站另外也提供了很多非常好的工具来帮助发单方和接单方顺利地完成项目工作和费用结算。
                        且本系统为每位发单方提供客服，解决基本的纠纷。
                    </p>
                </div>
                <div id="div1-2">
                    <h2>使命与愿景</h2>
                    <hr>
                    <p>
                        酷代的使命是为团队、为企业服务，当好团队的经纪人，接到满意感兴趣的项目，
                        当好企业的经纪人，找到满意感兴趣的团队。
                        当前阶段我们的愿景是打造信用度、满意度高的平台，对团队的项目成果数据化，
                        为企业项目提供更好的解决方案，找到契合最高的合作。
                        未来我们和更多优秀团队企业合作，入驻平台，打造研发更新平台，承接处理好每一个订单，
                        成为新理念、新技术、新标准的发源地团队。
                    </p>
                </div>
                <div id="div1-3">
                    <h2>联系方式</h2>
                    <hr>
                    <p>
                    电话: 0000-00000000<br/>
                    其他: <a href="/feedback" target="_blank">反馈网址</a>
                    </p>
                </div>
            </template>

            <!-- 常见问题 -->
            <template v-if="active == 2">
                <div id="div2-1">
                    <h2>接单人员</h2>
                    <hr>
                    <p>

                    1.费用结算时间<br/>
                        企业方『确认完工』后，费用会在3个工作日内结算到开发者账号或银行卡；<br/>
                    2.沟通中发现实质需求不符<br/>
                        团队可拒绝接单，并及时告知项目经理或平台服务人员。<br/>
                    3.提交完成企业不验收<br/>
                        开发完成需及时与企业方沟通，请企业方确认验收，如无法取得联系或企业方无特殊理由不进行验收，及时通知平台工作人员介入。<br/>
                    4.先移交代码再结算开发费用<br/>
                        平台会保证资金安全。需要先完成验收并提交源代码、开发文档规范、测试包等资料。企业方验收项目无误后会确认开发完成并评价，之后结算开发费用。<br/>
                    5.签约开发者和普通注册有什么不同<br/>
                        在酷代，只有签约开发者团队才能接受平台指派项目进行工作，或通过短期雇佣接受企业预约工作获得报酬<br/>
                    6.平台如何分配项目的
                        根据企业方的需求和开发者团队的经验、态度、时间等多维度来进行匹配。<br/>
                    7.完善的工作经验信息能提升开发者的竞争力，提高接单率。<br/>
                    8.拒绝接单对后面有影响吗<br/>
                        可以拒绝接单，对个人信用及后面开发没有影响。<br/>
            
                    9.签约失败的原因？<br/>
                        签约失败具体原因参考，邮件通知信息。<br/>
                    10.如何成为签约开发者 参考签约开发者手册。<br/>
                    11.签约开发者多久有项目 由于签约人数越来越多，所有项目对接时间不能固定保证。<br/>
                        目前酷代也主要集中在原型、设计、web前端、App这几块。酷代会做好项目审核，保证项目靠谱。
                        只要有与签约开发者最匹配的项目，我们就会及时对接过来。

                    </p>
                </div>
                <div id="div2-2">
                    <h2>企业</h2>
                    <hr>
                    <p>
                    1.邮件通知有项目但点详情却说没有权限<br/>
                    为什么邮件说是对接了项目但是点详情却说没有权限？
                    远程工作部分，平台会通过派单制主动对接项目到程序员，
                    程序员超过一小时未处理平台则会自动对接到下一位程序员，
                    如果下一位程序员接受开发，上一位程序员就没有处理权限了。<br/>
                    2.可以开发票吗？<br/>
                    酷代是一个互联网众包服务平台，本身并不收取需求方的项目款，只是临时托管项目费用，
                    待项目验收完毕以后结款给开发者，针对平台不同的开发模式，需求方可以通过两种方式获得项目款的发票：<br/>
                    •	整包项目、云端工作：需求方需支付项目款/工资9.36%的开票费用，并在项目费用/工资托管之前向平台商务负责人提出，
                    酷代栈收到税费之后，即可开票（托管费用后提出，酷代不予受理）。<br/>
                    •	短期雇佣：需求方跟开发者达成一致，由开发者提供项目款发票给需求方，程序员客栈不参与其中。<br/>
                    3.可以签订合同吗<br/>
                    平台默认签订电子协议，发布项目后可以联系酷代工作人员补充签订纸质合同。
                    5.项目源代码是企业方的吗<br/>
                    平台开发者都是严格筛选的，经验丰富，源代码为独立开发。平台和开发者的协议包含不允许抄袭。开发成果为企业方所有。<br/>
                    6.有没有保密协议<br/>
                    平台和签约开发者都有保密协议，开发者有义务及责任为企业方提供的项目相关材料进度保密。
                    平台对企业方和开发者的个人信息也完全保密。平台项目完全封闭式对接。<br/>
                    7.质量有问题怎么办<br/>
                    项目完成时，企业方验收发现问题，可要求开发修复，直至问题解决。<br/>
                    8.如何找开发者，怎么雇佣？<br/>
                    在酷代列表页，按方向筛选，接单过的可以按评价筛选。<br/>
                    9.取消雇佣<br/>
                    如接单人未接受雇佣，企业在我的工作—>我雇佣的可以取消。如已经接受预约雇主未托管费用24小时后系统自动取消。<br/>
                    10.项目发布后怎么操作？<br/>
                    发布成功后等待我们项目经理联系，确认需求提供报价。<br/>
                    11.发单的话，要付钱吗？<br/>
                    发布项目不收费，托管我们平台开发才收取一定服务费。<br/>
                    12.项目发布后还能修改需求吗？<br/>
                    项目发布后需要项目经理先驳回才能修改需求，可以联系我们协助修改。<br/>
                    13.有软件开发需求，咨询软件开发，要做一个网站，要做一个APP？<br/>
                    请留下你的联系方式，我们会尽快联系你。<br/>
                    14.需求文件上传不了<br/>
                    系统限制文件大小在200M均可以上传，特别大的文件请联系工作人员发送<br/>
                    15.产品已上线修改小Bug<br/>
                    可以先雇佣适合方向的程序员优化，如果工作量较大可以发布到平台，进行按月雇佣。<br/>
                    16.开发一款APP,网页要多少费用？<br/>
                    我们平台根据功能点进行报价，报价均为开发者纯人力成本，发布项目后客栈项目经理会根据功能点来提供报价。<br/>
                    17.项目要审核多久？<br/>
                    项目经理会在24小时内联系您，并确认需求报价。如未接到项目经理电话可以反馈给我们。<br/>
                    </p>
                </div>
            </template>

            <!-- 开发者签约 -->
            <template v-if="active == 3">
                <div id="div3-1">
                    <h2>如何签约</h2>
                    <hr>
                    <p>
                    登录酷代，点击『签约接单』->填写基本资料->提交审核。审核情况我们会及时邮件通知您。<br/>

                    审核需要2-3个工作日，节假日除外。真实姓名、手机工作后可见，支付宝账号仅用于平台联系及打款，不会对外展示。<br/>
                    </p>
                </div>
                <div id="div3-2">
                    <h2>签约规则</h2>
                    <hr>
                    <p>
                    满足以下条件的开发者，才符合我们的签约条件：<br/>

                    1.知名正式公司正式技术/设计岗3年及以上工作时间(实习工作经历不计算为正式技术岗工作时间），且年满24周岁<br/>

                    2.有特别擅长并专一的语言及技能，技术能力强，满足『签约开发者技术能力细则』的要求<br/>

                    3.正式公司三年正式工作期间，不同时期技术岗位为同一职业发展方向<br/>

                    4.正式公司三年正式工作期间，工作经历跳槽公司不超过4家，优先展示和需要认证的其它工作经历<br/>

                    5.个人代表性作品（不低于3个）应保证真实可靠，每个代表作品除上传有效链接和详细在文字描述外，
                    至少上传一张作品成功运行界面截图，作品描述应保证尽可能详细完整<br/>

                    6.教育经历需上传相关学历证明进行认证，教育时间需符合常规时间<br/>

                    8.契约精神，服务意识，能按协商的约定完成开发<br/>

                    9.不在酷代黑名单（有开发黑历史）<br/>
                    </p>
                </div>
                <div id="div3-3">
                    <h2>签约失败说明</h2>
                    <hr>
                    <p>
                1.未同时满足酷代签约条件<br/>
                2.所有需个人信息填写部分，个人昵称、个人头像、个人介绍、工作描述、教育描述、作品描述等需进行文字描述部分
                包含敏感词汇（广告链接、外包团队宣传、连续数字）或存在违反国家法律法规的不当的描述。<br/>
                3.个人主页填写不规范，酷代原则上签约知名公司正式岗3年及以上工作时间的接单人，
                所以会拒绝应届生、刚接受完培训的人员签约申请，会拒绝大部分工作经验不满条件的接单者。<br/>
                    </p>
                </div>
                <div id="div3-4">
                    <h2>取消签约</h2>
                    <hr>
                    <p>
                    为保持平台开发协作质量，对不能满足在平台开发协作的签约者采取退出机制。
                    对于严重违反平台规则的开发者，永久取消签约。对于随着签约信息的陆续完善，
                    不再符合签约标准的开发者，将取消签约，提示修改，完善信息后可再次申请签约认证。<br/>

                    1.永久取消签约（黑名单）：<br/>

                    提交虚假信息。<br/>
                    引导客户进行线下交易或打款。<br/>
                    跳过平台私下与他人一起协作或转交他人完成项目。<br/>
                    技术水平不过关，交付不合格，引起仲裁，纠纷。<br/>
                    不遵守平台规则，降低权重达两次。<br/>
                    维护期内拒绝履行修复任务。<br/>
                    项目过程中，因个人原因中途退出项目。<br/>
                    所在项目因个人原因延误引起纠纷。<br/>
                    个人原因包括不限于：不仔细评估需求文档、技能要求，接单后能力不足无法开发。<br/>
                    未充分评估个人时间，开发过程中无法保证工作时间。<br/>

                    2.临时取消签约：<br/>

                    签约简历不符合现有平台规则（含签约简历内容不完善，签约简历信息不真实，未提供必要证明材料）。<br/>

                    签约通过后删除、修改个人信息，或提供作品的链接失效、侵权，导致不满足签约条件。<br/>
                    </p>
                </div>
            </template>
          </el-card>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "HelpDocument",
  data() {
    return {
      active: "1"
    };
  },
  methods: {
    choose(num,id) {
      this.active = num;
      window.location.href ="#" +id; 
    }
  }
};
</script>

<style>
.el-header {
  background-color: #b3c0d1;
  color: #333;
  line-height: 60px;
}

.el-aside {
  color: #333;
}
</style>
